{
  "problem": "Six points $A, B, C, D, E,$ and $F$ lie in a straight line in that order. Suppose that $G$ is a point not on the line and that $AC=26, BD=22, CE=31, DF=33, AF=73, CG=40,$ and $DG=30.$ Find the area of $\\triangle BGE.$",
  "problem_id": "15",
  "behavior_book": {
    "skill_coordinateGeometryForCollinearPoints": "When to use: When dealing with geometric problems involving points aligned on a straight line, coordinate geometry provides an effective method by assigning numerical coordinates to simplify distance calculations and locate missing points. It transforms geometric relationships into algebraic equations, making it easier to solve for unknowns. Step-by-step: 1) Assign a coordinate system to the points, often placing one point at the origin for simplicity. 2) Label each point with a variable representing its position along the axis. 3) Use the given distances between points to establish equations relating these variables. 4) Solve the system of equations to find the exact positions of each point. 5) Use these coordinates to calculate distances, slopes, midpoints, or other required measurements. 6) Optionally, employ vector analysis or trigonometry if additional complexity arises. 7) Verify the solution by checking consistency with all given distances and angles. Key insights: Coordinate geometry streamlines spatial reasoning by converting geometric problems into algebraic ones. It allows precise determination of point locations and facilitates calculations of distances and areas. By systematically assigning coordinates and solving equations, even intricate geometric configurations become tractable.",
    "skill_shoelaceFormulaForTriangleArea": "When to use: When calculating the area of a polygon whose vertices are known in a Cartesian plane, especially triangles, quadrilaterals, etc. This method is ideal for problems where vertices' coordinates are provided without explicit geometric constructions. Step-by-step: 1) List the coordinates of the vertices in a sequential order, either clockwise or counterclockwise. 2) Multiply each vertex's x-coordinate by the next vertex's y-coordinate and sum these products. 3) Similarly, multiply each vertex's y-coordinate by the next vertex's x-coordinate and sum these products. 4) Subtract the second sum from the first sum. 5) Take the absolute value of the result and divide by 2 to obtain the area. 6) Handle cases where the polygon intersects itself or is concave with caution, possibly by dividing into smaller components. 7) Verify accuracy by comparing with alternative methods or rechecking calculations. Key insights: The shoelace formula efficiently computes areas using determinants, avoiding the need for base-height identification. It ensures precision regardless of polygon orientation or scale.",
    "skill_intersectionOfCirclesForPointLocation": "When to use: When locating a point whose distances to two or more other fixed points are known, intersection of circles is an effective method. This approach is commonly used in navigation, engineering, and various geometric constructions. Step-by-step: 1) Define each fixed point as the center of a circle with radii corresponding to the known distances from the target point. 2) Write the equations of each circle based on the centers and radii. 3) Solve the system of equations simultaneously to find the intersection points, which represent possible locations of the target point. 4) Determine the feasible location based on context or additional constraints. 5) Validate the solution by confirming distances match given criteria. 6) In case of multiple intersections, further information may be needed to resolve ambiguity. 7) Visualize the result by plotting the circles and intersection points to aid understanding. Key insights: Intersecting circles provide precise locations by leveraging multiple constraints. Solving simultaneous equations offers exact solutions, which can sometimes lead to unique or multiple answers depending on the problem setup."
  }
}