{
  "problem": "A piecewise linear function is defined by\\[f(x) = \\begin{cases} x & \\operatorname{if} ~ -1 \\leq x < 1 \\ 2 - x & \\operatorname{if} ~ 1 \\leq x < 3\\end{cases}\\]and $f(x + 4) = f(x)$ for all real numbers $x$. The graph of $f(x)$ has the sawtooth pattern depicted below. The parabola $x = 34y^{2}$ intersects the graph of $f(x)$ at finitely many points. The sum of the $y$-coordinates of all these intersection points can be expressed in the form $\\tfrac{a + b\\sqrt{c}}{d}$, where $a$, $b$, $c$, and $d$ are positive integers such that $a$, $b$, $d$ have greatest common divisor equal to $1$, and $c$ is not divisible by the square of any prime. Find $a + b + c + d$. Graph [asy] import graph;  size(300);  Label f;  f.p=fontsize(6);  yaxis(-2,2,Ticks(f, 2.0));  xaxis(-6.5,6.5,Ticks(f, 2.0)); draw((0, 0)..(1/4,sqrt(1/136))..(1/2,sqrt(1/68))..(0.75,sqrt(0.75/34))..(1, sqrt(1/34))..(2, sqrt(2/34))..(3, sqrt(3/34))..(4, sqrt(4/34))..(5, sqrt(5/34))..(6, sqrt(6/34))..(7, sqrt(7/34))..(8, sqrt(8/34)), red); draw((0, 0)..(1/4,-sqrt(1/136))..(0.5,-sqrt(1/68))..(0.75,-sqrt(0.75/34))..(1, -sqrt(1/34))..(2, -sqrt(2/34))..(3, -sqrt(3/34))..(4, -sqrt(4/34))..(5, -sqrt(5/34))..(6, -sqrt(6/34))..(7, -sqrt(7/34))..(8, -sqrt(8/34)), red); draw((-7,0)--(7,0), black+0.8bp); draw((0,-2.2)--(0,2.2), black+0.8bp);  draw((-6,-0.1)--(-6,0.1), black); draw((-4,-0.1)--(-4,0.1), black); draw((-2,-0.1)--(-2,0.1), black); draw((0,-0.1)--(0,0.1), black); draw((2,-0.1)--(2,0.1), black); draw((4,-0.1)--(4,0.1), black); draw((6,-0.1)--(6,0.1), black);  draw((-7,1)..(-5,-1), blue); draw((-5,-1)--(-3,1), blue); draw((-3,1)--(-1,-1), blue); draw((-1,-1)--(1,1), blue); draw((1,1)--(3,-1), blue); draw((3,-1)--(5,1), blue); draw((5,1)--(7,-1), blue); [/asy]",
  "problem_id": "10",
  "behavior_book": {
    "skill_intervalAnalysis": "When to use: When analyzing functions that have different behaviors or definitions over different intervals, specifically for identifying where a function takes on particular values or shapes within those intervals. This is commonly used in calculus, piecewise functions, or periodic phenomena where understanding the behavior over each interval is crucial. Step-by-step: 1) Determine the intervals over which the function has a consistent definition or behavior - this involves identifying breakpoints or points where the function's definition or properties change 2) For each interval, analyze the function's characteristics such as monotonicity, concavity, extrema, asymptotes, or continuity 3) investigate the function's interaction with horizontal lines, vertical lines, or other reference functions within each interval by setting the function equal to the reference value and solving for the independent variable 4) Check the validity of solutions by ensuring they lie within the specified intervals 5) Interpret the results in the context of the original problem, considering the implications of the function's behavior within each analyzed interval Key insights: Interval analysis helps dissect complex functions into more manageable parts, making it easier to understand their behavior and solve related problems.",
    "skill_quadraticEquationSolving": "When to use: When solving equations with quadratic expressions, especially when the equation can be transformed into standard quadratic form through algebraic manipulation. This is particularly useful for equations that involve squared terms, products of variables, or other non-linear elements where traditional linear solving techniques are insufficient. Step-by-step: 1) Rearrange the equation to bring all terms to one side, ensuring the equation is in the form ax² + bx + c = 0, where a ≠ 0 2) Identify the coefficients a, b, and c from the equation 3) Apply the quadratic formula: x = [-b ± sqrt(b² - 4ac)] / (2a) to find the solutions 4) Calculate the discriminant (Δ = b² - 4ac) to determine the nature of the roots - if Δ > 0, two distinct real roots; if Δ = 0, one real root; if Δ < 0, no real roots 5) Simplify the square root and numerator to obtain the final solutions 6) Present the solutions as fractions or decimals, depending on the requirement 7) Verify the solutions by substituting them back into the original equation to ensure accuracy. Key insights: Quadratic equations often arise in geometry, physics, optimization, and statistics problems. The quadratic formula provides a reliable method to find solutions, and understanding the discriminant helps predict the number and type of roots upfront.",
    "skill_functionIntercepts": "When to use: When determining the points where a function crosses the x-axis (roots) or y-axis (y-intercept). This is essential in graphing functions, analyzing their behavior, or solving real-world problems involving zero crossings or equilibrium points. Step-by-step: 1) For x-intercepts (roots): Set the function equal to zero (f(x) = 0) and solve for x 2) For y-intercepts: Plug in x = 0 into the function and evaluate f(0) 3) Depending on the complexity of the function, employ appropriate solving techniques - factoring, quadratic formula, logarithmic/exponential rules, or numerical methods for non-algebraic equations 4) Verify solutions by substituting them back into the original equation to ensure they satisfy f(x) = 0 5) Record the intercept coordinates as ordered pairs (x, 0) for roots or (0, f(0)) for y-intercept 6) Analyze the multiplicity of roots if applicable, noting whether a root touches or crosses the axis 7) Understand the function's end behavior relative to the intercepts to aid in graphing or further analysis Key insights: Intercepts provide critical points for graphing functions and offer insights into the function's behavior, zeros, and transformations.",
    "skill_graphicalAnalysis": "When to use: When visualizing and interpreting mathematical relationships, especially for functions or data sets that are difficult to analyze numerically alone. This includes identifying trends, maxima, minima, intercepts, or patterns that aren't immediately obvious from algebraic representations. Step-by-step: 1) Plot the function or data points on a coordinate system to create a graphical representation 2) Observe the overall shape, direction, and key features of the graph - such as upward or downward trends, peaks, valleys, intersections with axes, or asymptotic behavior 3) Identify significant points like intercepts, vertices, inflection points, or discontinuities 4) Use the graph to estimate solutions to equations, inequalities, or optimization problems 5) Cross-reference graphical observations with algebraic results to validate findings or fill in analytical gaps 6) Communicate findings effectively by providing a visual representation of the mathematical behavior 7) Use transformations or scaling to adjust the graph for clarity or comparison with other graphs Key insights: Visualizing functions helps in developing intuition, catching errors in calculations, and understanding abstract concepts through concrete examples.",
    "skill_intervalArithmetic": "When to use: When performing arithmetic operations on interval notation, such as addition, subtraction, multiplication, or division of intervals. This is particularly useful in calculus, real analysis, or when dealing with uncertainties in measurements represented as intervals. Step-by-step: 1) For addition/subtraction: Combine the lower bounds and upper bounds separately to form new intervals 2) For multiplication/division: Be cautious with signs; multiplying or dividing by negative intervals reverses the order of bounds 3) Handle constant intervals differently, especially when scaling by a constant factor 4) Use properties of intervals to simplify expressions or compare results with known intervals 5) Pay attention to cases where intervals overlap or are disjoint, affecting the resultant interval's validity 6) Represent the result as a new interval or state that the operation leads to ambiguity or undefined results 7) Apply these operations in contexts like error propagation, signal processing, or optimization under uncertainty Key insights: Interval arithmetic is crucial for maintaining precision in calculations involving uncertain quantities and for bounding errors in numerical computations.",
    "skill_absoluteValueEquation": "When to use: When solving equations or inequalities that involve absolute values, especially when the variable appears inside the absolute value symbol. Absolute value equations often represent distances or constraints that require considering multiple cases. Step-by-step: 1) Isolate the absolute value expression on one side of the equation 2) Recognize that the absolute value represents distance, so set up two separate equations: one with the positive value and one with the negative 3) Solve both equations separately 4) Check for extraneous solutions by substituting back into the original equation, as squaring or manipulating absolute value equations can introduce invalid roots 5) For inequalities, consider the cases where the expression inside the absolute value is positive or negative and solve accordingly 6) Graphically interpret the solutions by plotting the absolute value function and seeing where it intersects with the reference value 7) Understand that geometrically, absolute value equations represent V-shaped graphs, helping visualize the solutions Key insights: Absolute value equations often appear in real-life scenarios like distance, temperature ranges, or tolerances, making them essential in various applications.",
    "skill_piecewiseFunctionGraphing": "When to use: When graphing functions defined piecewise, consisting of different expressions over different intervals. This is necessary for accurately representing functions with varying definitions across their domain. Step-by-step: 1) Identify the intervals over which each piece of the function is defined 2) For each interval, plot the corresponding function expression 3) Ensure continuity or discontinuity at interval boundaries is handled correctly 4) Pay attention to open or closed circles at endpoints to indicate inclusion or exclusion 5) Consider transformations (shifts, stretches, reflections) applied to basic functions within each interval 6) Use test points within each interval to verify the function's behavior and correctness 7) Connect the pieces smoothly or appropriately, respecting the function's definition across the entire domain Key insights: Piecewise functions allow for modeling complex behaviors by defining different rules in different parts of the domain, and accurate graphing is essential for understanding the function's overall behavior and solving related problems.",
    "skill_systemOfEquations": "When to use: When solving systems of equations, especially when dealing with multiple variables or nonlinear equations that cannot be easily solved simultaneously with straightforward substitution or elimination. This approach is versatile and can handle a wide variety of equation structures. Step-by-step: 1) Write down all the equations that relate the variables 2) Choose a method to solve the system: substitution, elimination, matrix methods, or iterative techniques for nonlinear systems 3) For substitution: Solve one equation for one variable and substitute into the others; for elimination: Add or subtract equations to eliminate variables 4) Reduce the system step-by-step until you can solve for individual variables 5) Back-substitute the found values into prior equations to solve for remaining variables 6) Verify all solutions by plugging them back into the original equations to ensure consistency 7) Handle nonlinear systems by applying appropriate substitutions or numerical methods when symbolic solutions are not feasible Key insights: Systems of equations model interactions between variables, and choosing the right solving method is key to obtaining accurate solutions efficiently.",
    "skill_functionTransformations": "When to use: When transforming a parent function into a new function through translations, reflections, scalings, or compressions. This is essential for graphing and understanding how modifications affect the original function's appearance and behavior. Step-by-step: 1) Identify the transformation applied to the parent function - translation (horizontal/vertical shifts), reflection (over x or y-axis), scaling (horizontal/vertical stretch/compression), rotation, or combinations thereof 2) Apply the transformation to each point on the parent function according to the rule for that transformation 3) Graph the transformed function by adjusting key points, asymptotes, or intercepts accordingly 4) Understand how the transformation affects the function's domain, range, amplitude, period, midline, or frequency (for trigonometric functions) 5) Use transformations to write the equation of the new function based on the parent function and the described transformations 6) Combine multiple transformations by applying them in sequence, remembering that order matters 7) Analyze the transformed function's behavior relative to the parent function to answer questions about its shape, position, or properties Key insights: Function transformations are powerful tools for predicting and constructing complex functions from simpler ones, enabling deeper insights into functional relationships.",
    "skill_functionSymmetry": "When to use: When analyzing whether a function is even, odd, or neither, which reveals its symmetry properties. This helps in graphing the function, understanding its behavior, or simplifying integration/differentiation processes. Step-by-step: 1) Determine if f(-x) = f(x) for all x in the domain (even function) or f(-x) = -f(x) for all x in the domain (odd function) 2) Test specific points to check for symmetry: for evenness, reflect points across the y-axis; for oddness, reflect points across the origin 3) Graph the function to visually inspect symmetry about the y-axis (even) or the origin (odd) 4) Utilize symmetry properties to simplify calculations, such as integrating over symmetric intervals or evaluating definite integrals 5) Note that not all functions possess symmetry, and asymmetric functions lack predictable reflection properties 6) Combine symmetry knowledge with derivative tests to understand increasing/decreasing behavior across different intervals Key insights: Symmetry is a fundamental characteristic of functions, aiding in quick determination of their properties and facilitating efficient problem-solving.",
    "skill_functionDerivatives": "When to use: When finding the rate of change or slope of a function at a particular point, essential for analyzing function growth, extrema, and optimization. This is the cornerstone of differential calculus. Step-by-step: 1) For a function f(x), compute its derivative f'(x) using differentiation rules such as power rule, product rule, quotient rule, or chain rule 2) Evaluate the derivative at the point of interest to find the instantaneous rate of change 3) Set the derivative equal to zero to find critical points, which could be local maxima or minima 4) Use the second derivative test to classify critical points as maximums, minimums, or saddle points 5) Analyze intervals around critical points to determine where the function is increasing or decreasing 6) Apply Rolle's theorem or Mean Value theorem to establish relationships between function values and derivatives 7) Use derivatives to solve optimization problems by identifying global and local extrema Key insights: Derivatives provide essential information about a function's behavior, enabling prediction of trends, turning points, and sensitivity to change.",
    "skill_quadraticVertexForm": "When to use: When rewriting a quadratic equation from standard form (ax² + bx + c) to vertex form (a(x - h)² + k), revealing the vertex and axis of symmetry. This is useful for graphing, finding maximum/minimum values, and solving optimization problems. Step-by-step: 1) Start with the quadratic equation in standard form: ax² + bx + c = 0 2) Factor out the coefficient 'a' from the x² and x terms: a(x² + (b/a)x) + c = 0 3) Complete the square by adding and subtracting (b/(2a))² inside the equation 4) Rewrite the completed square expression as a perfect square trinomial and simplify the constants 5) Express the quadratic equation in vertex form: a(x - h)² + k = 0, where h = -b/(2a) and k = c - (b²)/(4a) 6) Identify the vertex (h, k) and the axis of symmetry x = h from the vertex form 7) Use the vertex and direction of opening (based on 'a') to graph the parabola and analyze its behavior Key insights: Vertex form provides direct access to key features of a quadratic function, making it invaluable for analysis and application.",
    "skill_quadraticInequalities": "When to use: When solving inequalities involving quadratic expressions, especially those that can be transformed into standard quadratic form. This includes finding intervals where the quadratic is positive, negative, zero, or comparing it to another quadratic or constant. Step-by-step: 1) Write the inequality in standard form: ax² + bx + c < 0 or > 0 2) Factor the quadratic expression if possible, identifying its roots 3) Plot the roots on a number line to divide it into intervals 4) Test each interval by selecting a test point to determine the sign of the quadratic expression in that interval 5) Identify the intervals where the inequality holds true based on the test results 6) Include equality points (if the inequality includes",
    "skill_interpolation": "When to use: When estimating intermediate values within a known set of discrete data points, particularly when the data follows a smooth trend or pattern. Commonly used in fields like engineering, physics, and computer graphics. Step-by-step: 1) Arrange the known data points in ascending order of the independent variable 2) Determine the interpolation method: linear, polynomial, spline, or other based on the desired accuracy and smoothness 3) For linear interpolation: Find the nearest two data points surrounding the desired x-value and use the linear approximation between them 4) For polynomial interpolation: Fit a polynomial through the data points and evaluate it at the desired x-value 5) For spline interpolation: Divide the data into segments and fit low-degree polynomials (splines) within each segment 6) Extrapolation can also be performed by extending the interpolating function beyond the known data range, with caution as it may not be accurate 7) Validate the interpolation results against additional data points or physical constraints Key insights: Interpolation balances accuracy and computational effort, with linear methods being simple but less precise, while higher-order methods offer better accuracy but require more computation.",
    "skill_factorization": "When to use: When factoring polynomials, especially cubic and higher-degree polynomials, to simplify expressions or solve equations. Essential for reducing complex expressions into manageable parts. Step-by-step: 1) Look for common factors in all terms and factor them out first 2) For binomials, recognize special forms like difference of squares, cubes, or higher powers and factor accordingly 3) For trinomials, attempt to factor into binomials using trial and error or the AC method 4) For higher-degree polynomials, use grouping or synthetic division to factor 5) Apply recursive factorization on factored polynomials if they are reducible further 6) Verify the factorization by expanding the factors to ensure they match the original polynomial 7) Factor completely over the rationals or factor into irreducible polynomials over the reals Key insights: Factorization is a foundational skill in algebra, crucial for solving equations, simplifying expressions, and analyzing functions.",
    "skill_graphicalUnderstanding": "When to use: When interpreting and analyzing graphs of functions or data, providing a visual representation that aids in understanding behavior, trends, and patterns. This is particularly important for reinforcing algebraic solutions, identifying key features, and communicating results. Step-by-step: 1) Examine the graph for overall shape, direction, and key landmarks like intercepts, asymptotes, maxima, and minima 2) Note the presence of symmetries, periodicity, or other recurring patterns indicative of specific function types 3) Read off specific values or estimates directly from the graph 4) Compare the graph to theoretical expectations or other similar graphs to infer relationships or discrepancies 5) Use the graph to support arguments or proofs by providing visual evidence of function behavior 6) Combine graph interpretation with algebraic methods for a comprehensive analysis 7) Understand limitations of graphical interpretation, such as scale distortion or resolution issues, and complement with numeric or analytic methods Key insights: Graphs serve as powerful tools for conveying and understanding mathematical information, enhancing intuition and reinforcing algebraic findings.",
    "skill_functionTransformationsOrder": "When to use: When applying multiple transformations to a function, ensuring the correct order of operations maintains the intended effect on the graph. This is crucial for accurately predicting the outcome of successive transformations. Step-by-step: 1) Identify the sequence of transformations: translations, reflections, scalings, rotations, etc. 2) Remember that horizontal transformations are counterintuitive (translating right is opposite to what the sign suggests) and order matters 3) Apply transformations step-by-step, updating the function equation each time, and track how the graph changes 4) Visualize or test each transformation individually before combining them 5) Check the final transformed function against expected outcomes or test points 6) Be cautious of composing transformations that may collapse into equivalent single transformations 7) Use composition of functions as a tool to describe combined transformations Key insights: Order of transformations is pivotal in achieving the correct final result, and misordering can lead to unintended consequences in graph behavior.",
    "skill_functionInverse": "When to use: When finding the inverse of a function, especially for one-to-one functions, to reverse its action and retrieve the original input from a given output. This is useful in solving equations and understanding bi-directional relationships. Step-by-step: 1) Confirm the function is one-to-one (passes the horizontal line test) to ensure an inverse exists 2) Swap the roles of x and y in the equation 3) Solve for y in terms of x to express the inverse function 4) Verify that the inverse function is indeed the reflection of the original function over the line y = x 5) Check specific points to ensure f(g(x)) = g(f(x)) = x 6) Consider restricting the domain of the original function if it's not naturally invertible 7) Analyze the inverse's domain and range, which are swapped from the original function's range and domain Key insights: Inverses help undo the original function, and their graphs are mirror images over y = x, making them inverses of each other.",
    "skill_systemOfEquationsApplications": "When to use: When solving real-world problems modeled by systems of equations, such as resource allocation, optimization, or motion planning. This involves translating word problems into mathematical equations and then solving them to find optimal or required values. Step-by-step: 1) Translate the problem's description into a system of equations relating the unknown variables 2) Choose an appropriate method for solving the system, considering the number and type of equations 3) Solve for the variables using substitution, elimination, matrices, or numerical methods 4) Interpret the solutions in the context of the original problem, ensuring they make sense dimensionally and contextually 5) Validate the solutions by plugging them back into the original equations and confirming consistency 6) Analyze the feasibility of solutions within the problem's constraints, discarding unrealistic or extraneous results 7) Communicate the results clearly, highlighting the significance and practical implications Key insights: Setting up and solving systems of equations is a fundamental skill for modeling and solving complex, multi-variable problems in science, engineering, economics, and other fields.",
    "skill_piecewiseFunctionEvaluations": "When to use: When evaluating a piecewise-defined function at specific points, ensuring accuracy by applying the correct rule to the relevant interval. This is essential for functions with changing definitions across different domains. Step-by-step: 1) Identify the value of x at which the function is to be evaluated 2) Determine which interval x falls into 3) Select the corresponding expression for that interval 4) Substitute x into the selected expression and compute the result 5) Simplify the expression as much as possible, paying attention to any restrictions or conditions within the interval 6) Repeat the process for each evaluation point as needed 7) Compile the results into a coherent output, ensuring consistency across evaluations Key insights: Proper identification of the correct interval is vital for accurate evaluations, and mixing up intervals can lead to incorrect results.",
    "skill_absoluteValueEquations": "When to use: When solving equations or inequalities involving absolute values, especially when the variable appears inside the absolute value symbol, complicating the process by introducing multiple cases. This is common in problems involving distances or deviations from a central value. Step-by-step: 1) Isolate the absolute value expression on one side of the equation or inequality 2) Set up two separate equations: one with the positive value and one with the negative 3) Solve each equation independently 4) Check each solution by substituting back into the original equation to ensure validity 5) For inequalities, consider both the positive and negative cases, leading to compound inequalities or conditional solutions 6) Graph the solutions on a number line to visualize the intervals 7) Report the solution set in proper interval or set notation Key insights: Absolute value equations often have two solutions, reflecting the dual nature of absolute value as measuring distance from zero irrespective of direction.",
    "skill_functionSymmetryTesting": "When to use: When testing whether a function is even, odd, or neither, to uncover its symmetry properties. This helps in graphing, simplifying integrals, or understanding periodicity. Step-by-step: 1) Check for even symmetry by verifying f(-x) = f(x) for all x in the domain 2) Check for odd symmetry by verifying f(-x) = -f(x) for all x in the domain 3) If neither condition holds, the function has no symmetry 4) Graph the function to visually confirm the symmetry about the y-axis (even) or origin (odd) 5) Use specific test points to confirm the symmetry properties 6) Understand that even functions are symmetric about the y-axis, while odd functions are symmetric about the origin 7) Apply symmetry in integration by recognizing that even functions integrate to even areas and odd functions integrate to zero over symmetric intervals Key insights: Symmetry can greatly simplify integral computations and provides deeper insights into function behavior.",
    "skill_quadraticFormulaApplication": "When to use: When applying the quadratic formula to find the roots of a quadratic equation, especially when factoring is difficult or impossible. This is a reliable method for solving any quadratic equation, providing exact solutions in radical form. Step-by-step: 1) Write the quadratic equation in standard form: ax² + bx + c = 0, where a ≠ 0 2) Identify the coefficients a, b, and c 3) Apply the quadratic formula: x = (-b ± sqrt(b² - 4ac)) / (2a) 4) Calculate the discriminant (Δ = b² - 4ac) to determine the nature of the roots 5) Compute the square root of the discriminant and simplify it as much as possible 6) Substitute the discriminant back into the formula to find the two solutions 7) Simplify the expressions for each root, rationalizing denominators if necessary Key insights: The quadratic formula provides a universal method for solving quadratics, returning both real and complex roots when necessary.",
    "skill_functionDerivativeMeaning": "When to use: When interpreting the derivative of a function in terms of rates of change, slopes, or marginal effects, especially in applied sciences, economics, or optimization problems. This helps in understanding how a function behaves locally and globally. Step-by-step: 1) Compute the derivative f’(x) of the function f(x) 2) Evaluate the derivative at the point of interest, x = a 3) The value f’(a) represents the instantaneous rate of change or slope of the tangent line to the function at x = a 4) Analyze the sign of f’(a) to determine if the function is increasing or decreasing at that point 5) Use the magnitude of f’(a) to assess how steep the function is increasing or decreasing 6) Apply the derivative to solve optimization problems by finding critical points where f’(x) = 0 or undefined 7) Relate the derivative to concepts like velocity, acceleration, or sensitivity in scientific models Key insights: The derivative is a measure of sensitivity, indicating how responsive a function is to changes in its input, making it invaluable in modeling dynamic systems.",
    "skill_quadraticVertexFinding": "When to use: When finding the vertex of a quadratic function, especially when completing the square or using vertex formula. This is useful for graphing, optimization, and understanding the extremum of a quadratic function. Step-by-step: 1) Write the quadratic function in standard form: f(x) = ax² + bx + c 2) Identify the coefficients a, b, and c 3) Use the vertex formula: h = -b/(2a) to find the x-coordinate of the vertex 4) Substitute h back into the function to find the y-coordinate, k = f(h) 5) The vertex is the point (h, k) on the graph of the quadratic function 6) Determine whether the vertex is a minimum or maximum based on the sign of the coefficient 'a' 7) Use the vertex form of the quadratic equation (f(x) = a(x - h)² + k) to rewrite the function centered at its vertex Key insights: The vertex is the highest or lowest point on the parabola, crucial for understanding the function's maximum or minimum value.",
    "skill_quadraticWordProblemSolving": "When to use: When solving word problems that can be modeled by quadratic equations, especially those involving area, volume, projectile motion, or profit maximization. This translates real-world scenarios into mathematical terms for analysis. Step-by-step: 1) Translating the problem's description into a quadratic equation by identifying known quantities, variables, and relationships 2) Setting up the equation based on the problem's parameters, ensuring units and dimensions are consistent 3) Solving the quadratic equation using factoring, completing the square, or the quadratic formula 4) Determining which of the solutions is meaningful in the context of the problem, rejecting extraneous solutions 5) Interpreting the solution in the context of the problem, converting back to the original units if necessary 6) Verifying the solution makes sense within the problem's constraints and requirements 7) Reporting the answer with appropriate units and precision Key insights: Quadratic word problems often hinge on correctly setting up the equation and interpreting the solutions in context.",
    "skill_quadraticInequalitySolving": "When to use: When solving quadratic inequalities, especially those with real roots, to find the intervals where the quadratic expression is positive or negative. This involves analyzing the sign chart and testing intervals around the roots. Step-by-step: 1) Write the quadratic inequality in standard form: ax² + bx + c > 0 or similar 2) Factor the quadratic expression if possible, finding its roots 3) Plot the roots on a number line to divide it into intervals 4) Test each interval by choosing a test point to determine the sign of the quadratic expression in that interval 5) Based on the inequality, select the intervals where the expression meets the required condition (positive or negative) 6) Include or exclude the roots based on whether the inequality is strict or non-strict 7) Write the solution as a union of intervals, considering the domain restrictions imposed by the inequality Key insights: The number of sign changes around the roots determines where the quadratic is positive or negative, and this can be systematically determined by testing each interval created by the roots.",
    "skill_quadraticSystemSolving": "When to use: When solving systems of equations where one or more equations are quadratic, especially when seeking exact solutions. This involves simultaneous solving of linear and quadratic equations, requiring substitution or other methods. Step-by-step: 1) Identify which equations are linear and which are quadratic 2) Solve the linear equations for one variable and substitute into the quadratic equation(s) 3) Expand and simplify the resulting equation(s) 4) Solve the resulting quadratic equation using factoring, completing the square, or the quadratic formula 5) Substitute the solutions back into the solved linear equations to find corresponding values of other variables 6) Check all solutions in the original equations to ensure consistency 7) Compile the solutions into ordered triplets or tuples depending on the number of variables Key insights: Solving mixed systems often requires a combination of methods, carefully managing which equation to substitute into when reducing the system's complexity.",
    "skill_quadraticExpressionManipulation": "When to use: When manipulating quadratic expressions, such as expanding, factoring, or completing the square, to simplify or transform them for further analysis. This is essential for solving equations, completing the square, or optimizing quadratic functions. Step-by-step: 1) Identify the quadratic expression needing manipulated 2) For expansion, distribute multiplication over addition/subtraction 3) For factoring, look for common factors or use techniques like grouping, difference of squares, or completing the square 4) For completing the square, rewrite the quadratic in terms of a perfect square trinomial plus a constant 5) Use the manipulated form to find the vertex, roots, or other properties of the quadratic function 6) Verify that the manipulations preserve the equality of the original expression 7) Apply the manipulation to solve related equations or inequalities Key insights: Correct manipulation is crucial for solving and understanding quadratic relationships, and errors can lead to incorrect conclusions.",
    "skill_quadraticGraphing": "When to use: When graphing quadratic functions, especially when transformations or multiple functions are involved. This helps in understanding the shape, orientation, and position of the parabola. Step-by-step: 1) Identify the parent function and any transformations applied (shifts, stretches, flips, etc.) 2) Determine the vertex of the transformed function by applying transformations to the parent's vertex 3) Find the direction of the opening (upward or downward) based on the coefficient 4) Locate the y-intercept by evaluating the function at x = 0 5) Identify the x-intercepts (roots) by solving the quadratic equation 6) Plot the vertex, intercepts, and additional points if necessary 7) Draw the parabola symmetrically around the vertex, passing through the intercepts and additional plotted points Key insights: Graphing quadratics helps visualize their behavior and identify key features like maximums, minimums, intercepts, and intercepts themselves.",
    "skill_quadraticMaximization": "When to use: When maximizing or minimizing a quadratic function, especially in optimization problems involving area, volume, or profit. This is achieved by finding the vertex of the parabola. Step-by-step: 1) Write the quadratic function in standard form: f(x) = ax² + bx + c 2) Determine if the parabola opens upward or downward by checking the coefficient 'a' 3) If it opens downward, the vertex is the maximum point; if it opens upward, the vertex is the minimum point 4) Find the x-coordinate of the vertex using h = -b/(2a) 5) Substitute h back into the function to find the corresponding y-coordinate 6) The vertex (h, k) gives the maximum or minimum value of the function 7) Interpret the result in the context of the problem, ensuring the solution fits within the given constraints Key insights: The vertex provides the extremum value, and its location depends solely on the coefficients of the quadratic, making it a powerful tool for optimization tasks.",
    "skill_quadraticYInterceptFinding": "When to use: When finding the y-intercept of a quadratic function, especially when analyzing its graph or solving related problems. This is straightforward by evaluating the function at x = 0. Step-by-step: 1) Set x = 0 in the quadratic function f(x) = ax² + bx + c 2) Simplify the equation to find f(0) = c 3) The y-intercept is the point (0, c) on the graph 4) Use this point to plot the function on a coordinate plane or to understand its crossing point with the y-axis 5) Analyze the function's behavior relative to the y-intercept, such as its increase or decrease on either side 6) Incorporate the y-intercept into broader analyses, like symmetry or transformations 7) Apply the knowledge of the y-intercept to solve equations or systems involving the quadratic function Key insights: The y-intercept is a fundamental feature of a quadratic's graph, providing immediate information about the function's starting point and its vertical positioning.",
    "skill_quadraticXInterceptFinding": "When to use: When finding the x-intercepts of a quadratic function, especially when solving equations or analyzing its graph. This involves finding the roots of the quadratic equation. Step-by-step: 1) Set the quadratic function equal to zero: ax² + bx + c = 0 2) Factor the quadratic expression if possible, using techniques like factoring by grouping or recognizing a difference of squares 3) If factoring fails, use the quadratic formula: x = (-b ± sqrt(b² - 4ac)) / (2a) 4) Calculate the discriminant (Δ = b² - 4ac) to determine the nature of the roots: two real roots if Δ > 0, one real root if Δ = 0, or no real roots if Δ < 0 5) Express the roots as fractions or decimals, simplifying radicals when necessary 6) The x-intercepts are the points (x, 0) corresponding to each root 7) Use the x-intercepts to plot the function on a coordinate plane or to understand its crossing points with the x-axis Key insights: X-intercepts reveal where the function crosses the horizontal axis, providing critical information for graphing and solving equations.",
    "skill_quadraticZerosFinding": "When to use: When finding the zeros of a quadratic function, essentially the same as finding the x-intercepts. This is crucial for understanding where the function crosses the x-axis. Step-by-step: 1) Follow the same process as finding x-intercepts, setting the function equal to zero and solving for x 2) Whether through factoring, completing the square, or the quadratic formula, the zeros are the x-values where the function equals zero 3) These zeros are also referred to as the roots of the quadratic equation 4) Analyze the zeros to understand the function's interaction with the x-axis, including multiplicities and whether they are repeated or distinct 5) Use the zeros to factor the quadratic into the form a(x - r₁)(x - r₂) = 0 6) Apply the zeros in real-world contexts, such as determining break-even points in business models or equilibrium positions in physics 7) Recognize that the average of the zeros gives the x-coordinate of the vertex, linking zeros to the function's symmetry Key insights: Zeros are the foundation for analyzing quadratic functions, providing insights into their graphical features and practical applications.",
    "skill_quadraticCompletingTheSquare": "When to use: When rewriting a quadratic expression in a form suitable for finding its vertex or solving equations. This method transforms the quadratic into a perfect square trinomial plus a constant, making it easier to analyze. Step-by-step: 1) Start with the quadratic expression in standard form: ax² + bx + c 2) Factor out the coefficient of x² from the first two terms: a(x² + (b/a)x) + c 3) Inside the parentheses, complete the square by adding and subtracting the square of half the coefficient of x: a[(x² + (b/a)x + ((b/(2a))²) - ((b/(2a))²)] + c 4) Rewrite the expression as a perfect square trinomial plus a constant: a[(x + (b/(2a)))² - (b²/(4a²))] + c 5) Distribute the 'a' and combine constants: a(x + (b/(2a)))² - (b²/(4a)) + c 6) Simplify to get the expression in vertex form: a(x - h)² + k, where h = -b/(2a) and k = c - b²/(4a) 7) Use the vertex form to easily identify the vertex (h, k) and analyze the quadratic's properties Key insights: Completing the square is a powerful tool for transforming quadratics, making it easier to find vertices, analyze behavior, or solve equations. It relies heavily on understanding binomial expansions and fraction operations.",
    "skill_quadraticGraphFeatureExtraction": "When to use: When extracting specific features of a quadratic function's graph, such as the vertex, intercepts, axis of symmetry, or maximum/minimum points. This is essential for graph analysis, optimization, and understanding the function's behavior. Step-by-step: 1) Identify the quadratic function in standard form: f(x) = ax² + bx + c 2) Determine the direction the parabola opens by the sign of 'a': upward if a > 0, downward if a < 0 3) Find the vertex using h = -b/(2a) and k = f(h), which is the maximum or minimum y-value 4) Calculate the y-intercept by evaluating f(0) = c 5) Find the x-intercepts by solving the quadratic equation, as discussed earlier 6) Identify the axis of symmetry as the vertical line x = h 7) Analyze the discriminant (Δ = b² - 4ac) to determine the number of real intercepts (two if Δ > 0, one if Δ = 0, none if Δ < 0) 8) Use these features to describe the graph's shape, location, and key points 9) Apply the extracted features to solve real-world problems, such as trajectory analysis or economic forecasting Key insights: Knowing these features allows for a thorough understanding of the quadratic's graph and its implications in various applications.,",
    "skill_quadraticDiscriminantAnalysis": "When to use: When testing whether a given value is a root of a quadratic equation, especially when factoring or verifying solutions. This involves substituting the value into the equation and checking if it satisfies the equality. Step-by-step: 1) Take the quadratic equation in standard form: ax² + bx + c = 0 2) Substitute the test value 'k' into the equation: a(k)² + b(k) + c 3) If the result is zero, 'k' is a root; otherwise, it is not 4) Repeat for each test value to find all roots or confirm non-roots 5) Use the roots to factor the quadratic expression or to find solutions to related problems 6) Apply the root test in conjunction with other methods like factoring or completing the square to fully solve the equation Key insights: Testing roots is a straightforward way to verify solutions, especially when factoring or understanding the equation's behavior. It avoids complicated computations and is a good starting point before diving into more advanced methods.",
    "skill_quadraticRootTest": "When to use: When testing the vertex of a quadratic function, especially in optimization problems or when verifying graph transformations. This involves substituting the vertex coordinates into the function to confirm their validity. Step-by-step: 1) Assume the quadratic function is given in standard form: f(x) = ax² + bx + c 2) Identify the vertex coordinates: h = -b/(2a) and k = f(h) 3) Substitute h into the function to calculate k: k = a(h)² + b(h) + c 4) Verify that the vertex (h, k) satisfies the conditions of the quadratic function's graph 5) Use the vertex to analyze the function's maximum or minimum value, its direction of opening, and its position relative to other points on the graph 6) Apply the vertex test to optimize functions or to analyze transformations in depth Key insights: The vertex test is crucial for quickly validating the correctness of a vertex calculation, which is essential for graphing and optimization problems. It ensures that the identified vertex aligns with the rest of the function's behavior,"
  }
}