{
  "problem": "Let $k$ be a real number such that the system \\begin{align*} &|25 + 20i - z| = 5 \\ &|z - 4 - k| = |z - 3i - k| \\end{align*} has exactly one complex solution $z$. The sum of all possible values of $k$ can be written as $\\frac{m}{n}$, where $m$ and $n$ are relatively prime positive integers. Find $m + n$. Here $i = \\sqrt{-1}$.$",
  "problem_id": "7",
  "behavior_book": {
    "skill_circleLineIntersection": "When to use: When analyzing geometric relationships between circles and lines, specifically to determine if they intersect at exactly one point (tangent), no points, or infinitely many points. This skill is particularly useful in problems involving optimization, minimal distance, or unique solutions in geometry. Step-by-step: 1) Represent the circle and line equations in standard form - the circle will have the equation (x-h)² + (y-k)² = r² and the line will be in the form Ax + By + C = 0. 2) Calculate the distance from the center of the circle (h,k) to the line using the distance formula: |Ah + Bk + C| / sqrt(A² + B²). 3) Compare this distance to the radius r - if the distance equals r, the line is tangent to the circle and intersects at exactly one point; if less than r, the line intersects the circle at two points; if greater than r, the line does not intersect the circle. 4) Apply this knowledge to the specific problem by identifying the circle's center and radius, and rewriting the line equation in standard form if necessary. 5) Compute the numerical value of the distance and compare it to the known radius to determine the nature of the intersection. Key insights: Understanding the relative positions of geometric figures is crucial for solving problems involving their interactions. The distance formula provides an efficient way to quantify proximity between a circle's center and a line. Knowing whether a line is tangent to a circle directly impacts the number of solutions to a system of equations representing those geometric entities.",
    "skill_complexNumberAnalysis": "When to use: When dealing with complex numbers and equations involving them, especially when translating such equations into geometric representations or analyzing properties related to magnitude and angles. This skill is integral for problems requiring visualization in the complex plane or interpreting complex transformations. Step-by-step: 1) Express the complex number in standard form a + bi, recognizing that 'a' corresponds to the x-coordinate and 'b' to the y-coordinate in the Cartesian plane. 2) Translate equations involving complex numbers into their corresponding geometric forms - for example, |z - w| = r represents a circle centered at w with radius r, while Im(z) = k represents a horizontal line at height k. 3) Rewrite all equations in terms of real and imaginary components separately if necessary, allowing for separation of variables or identification of conic sections. 4) Analyze the transformed equations using techniques from analytic geometry, such as completing the square to reveal circles, ellipses, hyperbolas, or parabolas. 5) Interpret the geometric meaning of solutions - for instance, finding points z that lie on both a circle defined by one equation and a line defined by another, leading to specific solutions in the complex plane. 6) Visualize the problem by sketching the real and imaginary axes and plotting relevant curves or lines to gain intuition about their possible intersections. 7) Use algebraic methods alongside geometric interpretations to solve for unknowns, confirming that each step maintains consistency with both forms of representation. Key insights: Complex analysis benefits from integrating algebraic manipulations with geometric intuition, providing a dual perspective that enhances problem-solving capabilities.",
    "skill_tangentCondition": "When to use: When verifying if a line is tangent to a circle, or conversely, finding the tangent lines to a circle from an external point. This skill is essential for problems requiring precise geometric constructions or determining unique points of contact between geometric figures. Step-by-step: 1) Start with the equation of the circle (x-h)² + (y-k)² = r² and the equation of the line Ax + By + C = 0. 2) Compute the distance d from the center (h,k) to the line using the formula d = |Ah + Bk + C| / sqrt(A² + B²). 3) For the line to be tangent to the circle, set this distance equal to the radius r: |Ah + Bk + C| / sqrt(A² + B²) = r. 4) Solve this equation for unknown variables if necessary, such as finding the slope or intercept of the tangent line given a particular circle. 5) If solving for the tangent line, recognize that there can be two possible tangents from an external point, leading to potentially two solutions, which aligns with the idea that the system would have exactly one solution per tangent line. 6) Once tangent conditions are satisfied, derive the equations of the tangent lines by incorporating additional constraints, such as passing through specific points outside the circle. 7) Validate the tangent lines by ensuring they touch the circle at exactly one point and do not cross it, confirming the geometric properties hold true. Key insights: Tangent conditions rely heavily on the interplay between linear and circular elements, necessitating a blend of algebraic precision and geometric understanding."
  }
}