{
  "problem": "The parabola with equation $y = x^2 - 4$ is rotated $60^\\circ$ counterclockwise around the origin. The unique point in the fourth quadrant where the original parabola and its image intersect has $y$-coordinate $\\frac{a - \\sqrt{b}}{c}$, where $a$, $b$, and $c$ are positive integers, and $a$ and $c$ are relatively prime. Find $a + b + c$.",
  "problem_id": "8",
  "behavior_book": {
    "skill_rotationalTransformation": "When to use: When dealing with geometric transformations, specifically rotations, of points or figures on a coordinate plane. This skill is essential for problems involving changing angles, orientations, or positions in various fields like computer graphics, physics, engineering, and design. Step-by-step: 1) Understand the center of rotation and the angle of rotation - in this case, the origin and 60 degrees clockwise. 2) Apply the rotation formulas to each coordinate of the figure or point. For a point (x, y), the rotated point (X, Y) is calculated using X = x*cosθ - y*sinθ and Y = x*sinθ + y*cosθ. 3) Substitute the original coordinates into the rotation formulas to find the new coordinates after rotation. 4) Plot or analyze the transformed figure or point in the new orientation relative to the original coordinate system. 5) Use the transformed coordinates to solve for intersections, distances, areas, or other geometric properties as required by the problem. Key insights: Rotational transformations preserve distances and angles but alter the position and orientation. Clockwise rotations are often represented by negative angles in mathematical contexts, affecting the direction of sine and cosine components in the transformation formulas.",
    "skill_quadraticFormula": "When to use: When solving quadratic equations of the form ax² + bx + c = 0 where factoring is not straightforward or impossible. This method provides a direct formula to find the roots of the equation. Step-by-step: 1) Ensure the quadratic equation is in standard form: ax² + bx + c = 0. 2) Identify the coefficients a, b, and c. 3) Apply the quadratic formula: x = [-b ± √(b² - 4ac)] / (2a). 4) Compute the discriminant D = b² - 4ac to determine the nature of the roots - if D ≥ 0, there are real roots; if D < 0, the roots are complex conjugates. 5) Calculate the two roots using the formula, keeping track of both the plus and minus cases for the square root. 6) Simplify the expressions under the square root and divide by 2a to obtain the final roots. 7) Verify the solutions by substituting them back into the original equation to confirm accuracy. Key insights: The quadratic formula is reliable for all quadratic equations regardless of the coefficients. It handles all cases, including those with irrational or complex roots, by relying solely on computation without needing guesswork or factoring.",
    "skill_intersectionPoints": "When to use: When determining the points where two geometric objects intersect, such as lines, circles, parabolas, ellipses, hyperbolas, or other conic sections. This skill is fundamental in analytic geometry and calculus, aiding in solving systems of equations representing these curves. Step-by-step: 1) Write down the equations of both geometric objects in a form suitable for solving simultaneously - typically standard forms for lines, circles, parabolas, etc. 2) Solve the system of equations by substitution or elimination to find the coordinates (x, y) that satisfy both equations. 3) For substitution, solve one equation for a variable and substitute into the other equation, reducing the system to fewer variables. For elimination, manipulate the equations to cancel out one variable by addition or subtraction. 4) Solve the resulting simplified equation(s) to find the possible values of one variable, then substitute back into one of the original equations to find the corresponding values of the other variable. 5) Check each solution in both original equations to ensure validity and eliminate any extraneous solutions that arise from squaring or other operations. 6) Interpret the solutions geometrically, ensuring consistency with the expected behavior of the curves. Key insights: Intersection points provide critical information about the relationship between two geometric figures, such as tangency, crossing, or containment. Solving systems of equations systematically ensures accurate determination of these points.",
    "skill_graphTransformations": "When to use: When analyzing or modifying graphs of functions, particularly when undergoing translations, reflections, stretches, compressions, or other affine transformations. This skill helps in predicting and sketching the transformed graph based on the original function's characteristics. Step-by-step: 1) Identify the parent function whose graph is being transformed - commonly linear, quadratic, absolute value, exponential, logarithmic, etc. 2) Note the sequence and type of transformations applied - translations (shifts), reflections, scalings (stretches/compressions), and vertical/horizontal asymptotes for rational functions. 3) Apply each transformation in the correct order, considering that transformations inside the function argument affect x-values differently than those outside. Specifically, horizontal shifts occur inversely to the operation inside the function, while vertical shifts adjust the output directly. Reflections over axes reverse the direction of transformations, stretching or compressing scales away from or towards the axis accordingly. 4) Use the transformed function's equation to plot key points, identify intercepts, vertices, asymptotes, and inflection points if necessary, and sketch the graph accordingly. 5) Analyze the transformed graph to interpret its behavior, such as increasing/decreasing intervals, maxima/minima, concavity, symmetry, or end behavior. Key insights: Understanding transformations allows for quick prediction of graph behavior without recomputing outputs, saving time and effort. Transformations are foundational in many areas of mathematics, science, and engineering, aiding in modeling real-world phenomena.",
    "skill_rotationFormulas": "When to use: When performing coordinate geometry involving rotations, especially in problems requiring the transformation of points or figures on a coordinate plane. This skill is crucial for calculating new coordinates after rotation, whether for graphing, solving geometric problems, or analyzing movement in dynamic systems. Step-by-step: 1) Define the center of rotation and the angle of rotation - in this case, the origin and 60 degrees clockwise. 2) Recall the rotation formulas for a point (x, y) rotated by an angle θ about the origin: - X = x*cosθ - y*sinθ - Y = x*sinθ + y*cosθ Depending on the direction of rotation, the angle may be positive (counterclockwise) or negative (clockwise). 3) Substitute the given angle into the rotation formulas. For a 60-degree clockwise rotation, θ = -60°, so cosθ = 0.5 and sinθ = -√3/2. 4) Apply these cosine and sine values to the original coordinates (x, y) to compute the new coordinates (X, Y) after rotation. 5) Use the transformed coordinates to solve for intersections, distances, areas, or other geometric properties as required by the problem. Key insights: Rotation preserves distances and angles but changes the orientation of the coordinate system. Using the correct rotation formulas ensures accurate transformation of points, enabling precise geometric analysis.",
    "skill_matrixOperations": "When to use: When dealing with systems of linear equations or transformations involving multiple variables, particularly when arranging equations in matrix form to facilitate solving using linear algebra techniques. This skill is essential in advanced algebra, engineering, physics, and computer graphics where multiple simultaneous equations need resolution. Step-by-step: 1) Represent each equation in the system as a row in a matrix, separating coefficients of variables from the constants. 2) Perform row operations to transform the matrix into reduced row-echelon form, aiming to achieve leading ones and zeros in other columns for each pivot. Common operations include swapping rows, multiplying a row by a scalar, and adding/subtracting rows to eliminate variables. 3) Continue the row reduction process until the matrix is upper triangular or diagonal, simplifying the system to easily computable forms. 4) Back-substitute from the simplified system to find the values of each variable, ensuring each substitution respects the equality established in previous steps. 5) Verify the solution by plugging the values back into the original system to confirm they satisfy all equations. Key insights: Matrix operations streamline the solving process for larger systems, making it efficient and systematic. They are powerful tools for handling complex dependencies between variables in various scientific and engineering applications."
  }
}